const API_BASE_URL = "http://127.0.0.1:5003";

const MODEL_FEATURES = {
  ensemble_full: [
    "面積(公頃)",
    "園區半徑3公里(女性人口數)",
    "園區半徑3公里(老化指數)",
    "國際商用機場距離(公里)",
    "園區半徑3公里(扶養比)",
  ],
  ensemble_basic: [
    "面積(公頃)",
    "園區半徑3公里(戶數)",
    "台鐵站距離(公里)",
    "高鐵站距離(公里)",
  ],
  xgb: ["園區半徑5公里(前1,350廠商工廠數量)", "園區半徑3公里(戶數)"],
  rf: [
    "園區半徑5公里(前1,350廠商工廠數量)",
    "園區半徑3公里(戶量)",
    "園區半徑3公里(女性人口數)",
    "園區半徑3公里(戶數)",
  ],
  svm: ["面積(公頃)", "國際商用港口距離(公里)", "園區半徑3公里(戶數)"],
  lr: [
    "園區半徑3公里(戶數)",
    "面積(公頃)",
    "園區半徑3公里(人口密度)",
    "國際商用港口距離(公里)",
    "園區半徑3公里(扶老比)",
    "園區半徑5公里(生產中工廠數量)",
    "園區半徑5公里(前1,350廠商工廠數量)",
  ],
};
